RutronikSystemSolutions/RutDevKit-PSoC62_ME310G1-WW/modem.c
/*
 * modem.c
 *
 *  Created on: 2021-08-24
 *      Author: GDR
 */

#include "cy_pdl.h"
#include "cyhal.h"
#include "cybsp.h"
#include "cy_retarget_io.h"
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "modem.h"
#include "StringCommandParser.h"
#include "string.h"
#include "stdlib.h"
#include "stdio.h"
#include "math.h"
#include "time.h"

extern void handle_error(void);

/*Modem global variables storage*/
modem_data_storage_t modem_data;

/*AT parser variables storage*/
extern TSCPHandler   SCPHandler;
/*Arduino UART object*/
extern cyhal_uart_t ardu_uart;
extern uint16_t aADCdata[2];

extern uint8_t aRxBuffer;

/*Telit Portal Authentication Templates*/
const char fcmd_HTTPPOST[] ="POST /api HTTP/1.0\r\nHost: api-de.devicewise.com\r\nContent-Type: application/json\r\nContent-Length:";
const char fcmd_dW_auth[]  = "{\"auth\":{\"command\":\"api.authenticate\",\"params\":{\"appToken\":\"%s\",\"appId\":\"%s\",\"thingKey\":\"%s\"}}}\r\n";
const char fcmd_dw_post_auth[]  = "{\"auth\":{\"sessionId\":\"%s\"},";

/*Telit Portal Post Templates*/
const char fcmd_dw_post_p1[]  = "\"1\":{\"command\":\"property.publish\",\"params\":{\"thingKey\":\"%s\",\"key\":\"temperature\",\"value\":%.2f}},";
const char fcmd_dw_post_p2[]  = "\"2\":{\"command\":\"property.publish\",\"params\":{\"thingKey\":\"%s\",\"key\":\"pressure\",\"value\":%.2f}},";
const char fcmd_dw_post_p3[]  = "\"3\":{\"command\":\"property.publish\",\"params\":{\"thingKey\":\"%s\",\"key\":\"humidity\",\"value\":%.2f}},";
const char fcmd_dw_post_p4[]  = "\"4\":{\"command\":\"property.publish\",\"params\":{\"thingKey\":\"%s\",\"key\":\"mag_xy\",\"value\":%d}},";
const char fcmd_dw_post_p5[]  = "\"5\":{\"command\":\"property.publish\",\"params\":{\"thingKey\":\"%s\",\"key\":\"batt_voltage\",\"value\":%d}},";
const char fcmd_dw_post_p6[]  = "\"6\":{\"command\":\"property.publish\",\"params\":{\"thingKey\":\"%s\",\"key\":\"signal_level\",\"value\":%d}},";
const char fcmd_dw_post_p7[]  = "\"7\":{\"command\":\"location.publish\",\"params\":{\"thingKey\":\"%s\",\"lat\":%s,\"lng\":%s,\"altitude\":%s,\"heading\":%s,\"speed\":%s,\"fixType\":\"manual\",\"fixAcc\":%s}}}}\r\n";

/*App ID and tokens*/
const char telit_appID[] = "5b542754447cfb36414b9b26";
const char telit_appToken[] = "SFBhqftn43LdjcrF";

/*Global variables for Telit cloud uploads*/
char telit_sessionId[25];
char post_buff[CMD_BUFF_LENGTH];
char post_length[16];

/*SMS Global Variables*/
char sms_buff[100];
char incoming_number[20];
_Bool msg_sts = false;
const char phone_number[]  = "+37069683975";
const char google_link[] ="http://maps.google.com/maps?q=%s,%s";

/*Modem Task Attributes*/
TaskHandle_t ModemTaskHandle = NULL;

/*Specific string copy function. Copies only digits and dots*/
static void strxcpy(char *dest, char *src)
{
    int limit;

    limit = 10;

    while(((*src >= '0') && (*src <= '9')) || (*src == '.') )
    {
        while(*src == ' ')
        {
            src++;
            limit--;

            if(limit <= 0)
            {
                break;
            }
        }

        *dest = *src;
        dest++;
        src++;
        limit--;

        if(limit <= 0)
        {
            break;
        }
    }
}

/*Converts latitude and longitude from NMEA to decimal */
static double nmea2dec(char *nmea, char type, char *dir)
{
    unsigned int idx, dot = 0;
    double dec = 0;
    for (idx=0; idx<strlen(nmea);idx++){
        if (nmea[idx] == '.')
        {
            dot = idx;
            break;
        }
    }

    if ((dot < 3) || (dot > 5))
    {
        return 0;
    }

    int dd;
    double mm;
    char cdd[5], cmm[10];
    memset(cdd, 0, sizeof(cdd));
    memset(cmm, 0, sizeof(cmm));
    if(type == 1)
    {
        strncpy(cdd, nmea, dot-2);
        strncpy(cmm, nmea+dot-2, 7);
    }
    if(type == 2)
    {
        strncpy(cdd, nmea, dot-2);
        strncpy(cmm, nmea+dot-2, 7);
    }

    dd = atoi(cdd);
    mm = atof(cmm);

    dec = dd + (mm/60);

    if (type == 1 && dec > MAX_LATITUDE)
        return 0;
    else if (type == 2 && dec > MAX_LONGITUDE)
        return 0;

    if (*dir == 'N' || *dir == 'E')
      return dec;
    else
      return -1 * dec;
}

void ShutDown(uint32_t seconds)
{
#if 0
  RTC_TimeTypeDef CurrentTime = {0};
  RTC_DateTypeDef CurrentDate = {0};
  RTC_AlarmTypeDef NewAlarm = {0};
  time_t UnixTime = {0};
  struct tm tim = {0};
  volatile uint8_t wdayconvfw[8] = {0,1,2,3,4,5,6,0};
  volatile uint8_t wdayconvbw[7] = {7,1,2,3,4,5,6};

  /* Get the RTC current Time */
  if((HAL_RTC_GetTime(hrtc, &CurrentTime, RTC_FORMAT_BIN)) != HAL_OK)
  {
    return;
  }
  /* Get the RTC current Date */
  if((HAL_RTC_GetDate(hrtc, &CurrentDate, RTC_FORMAT_BIN)) != HAL_OK)
  {
    return;
  }

  /*Prepare for time conversion to Unix format*/
  tim.tm_isdst = CurrentTime.DayLightSaving;
  tim.tm_year = (uint16_t)(CurrentDate.Year+2000-1900);
  tim.tm_mon = CurrentDate.Month-1;
  tim.tm_wday = wdayconvfw[CurrentDate.WeekDay];
  tim.tm_mday = CurrentDate.Date;
  tim.tm_hour = CurrentTime.Hours;
  tim.tm_min = CurrentTime.Minutes;
  tim.tm_sec = CurrentTime.Seconds;
  UnixTime = mktime(&tim);

  /*Add time in seconds here*/
  UnixTime = UnixTime + seconds;
  /*Convert back*/
  tim = *(localtime(&UnixTime));

  /* Enable the Alarm A */
  NewAlarm.AlarmTime.Hours = tim.tm_hour;
  NewAlarm.AlarmTime.Minutes = tim.tm_min;
  NewAlarm.AlarmTime.Seconds = tim.tm_sec;
  NewAlarm.AlarmTime.SubSeconds = 0;
  NewAlarm.AlarmTime.DayLightSaving = CurrentTime.DayLightSaving;
  NewAlarm.AlarmTime.StoreOperation = RTC_STOREOPERATION_RESET;
  NewAlarm.AlarmMask = RTC_ALARMMASK_DATEWEEKDAY;
  NewAlarm.AlarmSubSecondMask = RTC_ALARMSUBSECONDMASK_ALL;
  NewAlarm.AlarmDateWeekDaySel = RTC_ALARMDATEWEEKDAYSEL_WEEKDAY;
  NewAlarm.AlarmDateWeekDay = wdayconvbw[tim.tm_wday];
  NewAlarm.Alarm = RTC_ALARM_A;

  if (HAL_RTC_SetAlarm_IT(hrtc, &NewAlarm, RTC_FORMAT_BIN) != HAL_OK)
  {
    return;
  }

  /*Save flags to Backup register to be able to detect shut down*/
  HAL_RTCEx_BKUPWrite(hrtc, BACKUP_REG_NO, BACKUP_REG_VALUE);
  /*Shut Down*/
  HAL_PWREx_EnterSHUTDOWNMode();

#endif
}

