RutronikSystemSolutions/RutDevKit-PSoC62_ME310G1-WW/modem.c
void *memmem(const void *l, size_t l_len, const void *s, size_t s_len)
{
	const char *cur, *last;
	const char *cl = l;
	const char *cs = s;

	/* a zero length needle should just return the haystack */
	if (s_len == 0)
		return (void *)cl;

	/* "s" must be smaller or equal to "l" */
	if (l_len < s_len)
		return NULL;

	/* special case where s_len == 1 */
	if (s_len == 1)
		return memchr(l, *cs, l_len);

	/* the last position where its possible to find "s" in "l" */
	last = cl + l_len - s_len;

	for (cur = cl; cur <= last; cur++)
		if (cur[0] == cs[0] && memcmp(cur, cs, s_len) == 0)
			return (void *)cur;

	return NULL;
}

void SCP_Tick_Callback(void)
{
	SCP_Tick(10);
}

static inline _Bool ModemOn(uint16_t *pwr_level)
{
  /*Turn on power for LTE Modem*/
  if(*pwr_level < PWRONLVL)
  {
	/*Power Supply ON*/
	cyhal_gpio_write(ARDU_IO3, 0);
	vTaskDelay(pdMS_TO_TICKS(100));

	/*Modem ON*/
    cyhal_gpio_write(ARDU_IO8, 1);
    vTaskDelay(pdMS_TO_TICKS(5000));
    cyhal_gpio_write(ARDU_IO8, 0);
    if(*pwr_level >= PWRONLVL)
    {
      vTaskDelay(pdMS_TO_TICKS(1000));
      printf("MODEM POWER ON\n\r\n\r");
      return true;
    }
    else
    {
      return false;
    }
  }
  else
  {
	  printf("MODEM POWER ON\n\r\n\r");
	  return true;
  }
}

static inline _Bool ModemOff(uint16_t *pwr_level)
{
  /*Turn off power for LTE Modem*/
  if(*pwr_level >= PWRONLVL)
  {
	cyhal_gpio_write(ARDU_IO8, 1);
	vTaskDelay(pdMS_TO_TICKS(3000));
    cyhal_gpio_write(ARDU_IO8, 0);
    vTaskDelay(pdMS_TO_TICKS(3000));

	/*Power Supply OFF*/
    cyhal_gpio_write(ARDU_IO3, 1);
    vTaskDelay(pdMS_TO_TICKS(5000));

    if(*pwr_level < PWRONLVL)
    {
    	printf("MODEM POWER OFF\n\r\n\r");
    	return true;
    }
    else
    {
      return false;
    }
  }
  else
  {
	  printf("MODEM POWER OFF\n\r\n\r");
	  return true;
  }
}

uint32_t uart_send_buff(uint8_t *data_out, uint32_t size)
{
	return cyhal_uart_write_async(&ardu_uart, (void*) data_out, (size_t) size);
}

uint32_t uart_read_byte(uint8_t *pData)
{
	return cyhal_uart_read_async( &ardu_uart, (void *) pData, 1);
}

/*Incoming Call Function*/
static void IncomingCall(const char *pString)
{
    (void)pString;

    /*Reject the incoming call*/
    SCP_SendCommandWaitAnswer("ATH\r", "OK", 1000, 1);
}

/*Returns network registration status*/
static int32_t NetworkRegistrationCheck(void)
{
    char *result = NULL;
    int32_t ntwrk_stat = 0;
    uint8_t i;

    /*Check what type of network is currently in use*/
    result = SCP_SendCommandWaitAnswer("AT+COPS?\r\n", "OK", 500, 1);
    vTaskDelay(pdMS_TO_TICKS(100));

    /*We have response, lets look for the info in the receiver buffer*/
    if(result)
    {
        result = NULL;
        result = memmem((char*)SCPHandler.RxBuffer, CMD_BUFF_LENGTH, "+COPS:", sizeof("+COPS:")-1);

        /*Response found, lets look for the third (,) */
        for(i = 0; i < 3; i++)
        {
        	result = strchr(result, ',');
            if(!result)
            {
            	/*Something is wrong with a data?*/
            	return 0;
            }

            result++;
        }

        /*Read the result*/
        ntwrk_stat = atoi(result);
    }

    /*GSM Network*/
    if(ntwrk_stat == 0)
    {
    	result = NULL;

        /*Request network status info*/
        result = SCP_SendCommandWaitAnswer("AT+CREG?\r\n", "OK", 500, 5);
        vTaskDelay(pdMS_TO_TICKS(100));

        if(result)
        {
            result = NULL;
            result = memmem((char*)SCPHandler.RxBuffer, CMD_BUFF_LENGTH, "+CREG: ", sizeof("+CREG: ")-1);
            if(result)
            {
                result += 9;
                ntwrk_stat = atoi(result);
            }
        }
        else
        {
            return 0;
        }

        return ntwrk_stat;
    }


    /*NB-IoT/ LTE-M*/
    else if(ntwrk_stat == 8 || ntwrk_stat == 9)
    {
    	/*Request network status info*/
        result = SCP_SendCommandWaitAnswer("AT+CEREG?\r\n", "OK", 500, 5);
        vTaskDelay(pdMS_TO_TICKS(100));

        if(result)
        {
            result = NULL;
            result = memmem((char*)SCPHandler.RxBuffer, CMD_BUFF_LENGTH, "+CEREG: ", sizeof("+CEREG: ")-1);
            if(result)
            {
                result += 10;
                ntwrk_stat = atoi(result);
            }
        }
        else
        {
            return 0;
        }
    }

    return ntwrk_stat;
}

/*Returns Context status*/
static int32_t ContextStatusCheck(void)
{
    char *result = NULL;
    int32_t lte_stat = 0;

    /*Request network status info*/
    result = SCP_SendCommandWaitAnswer("AT#SGACT?\r\n", "OK", 1000, 1);
    vTaskDelay(pdMS_TO_TICKS(100));

    if(result)
    {
        result = NULL;
        result = memmem((char*)SCPHandler.RxBuffer, CMD_BUFF_LENGTH, "#SGACT: 1", sizeof("#SGACT: 1")-1);
        if(result)
        {
            result += 10;
            lte_stat = atoi(result);
        }
    }
    else
    {
        return 0;
    }

    return lte_stat;
}

/*Returns received signal quality */
static int32_t SignalQuality(void)
{
    int32_t signal_level = 0;
    char *result = NULL;

    /*Request RSSI*/
    result = SCP_SendCommandWaitAnswer("AT+CSQ\r\n", "OK", 2000, 1);

    if(result)
    {
        result = NULL;
        result = memmem((char*)SCPHandler.RxBuffer, CMD_BUFF_LENGTH, "+CSQ:", sizeof("+CSQ:")-1);
        if(result)
        {
            result += 6;
            signal_level = atoi(result);
        }
    }
    else
    {
        return 0;
    }

    return signal_level;
}

/*Waits for network available, suspends actual task*/
static _Bool WaitForNetwork(void)
{
    int32_t test = 0;
    int signal = 0;

    /*Wait for network available*/
    for(uint32_t i=0; i < WAIT_FOR_NETWORK_S; i++)
    {
        /*Get current network state*/
        test = NetworkRegistrationCheck();

        /*registered, home network  or  registered, roaming is acceptable*/
        if((test == 1) || (test == 5))
        {
          /*Check the signal level*/
          signal = SignalQuality();
          if(signal != 99)
          {
            /*Turn off LED2*/
        	cyhal_gpio_write(LED2, CYBSP_LED_STATE_OFF);

