RutronikSystemSolutions/RutDevKit-PSoC62_ME310G1-WW/modem.c
            return true;
          }
          else
          {
            /* Wait 1000ms */
            vTaskDelay(pdMS_TO_TICKS(1000));
          }
        }
        else
        {
            /* Wait 1000ms */
        	vTaskDelay(pdMS_TO_TICKS(1000));
        }

        /*Indicate network search with LED2*/
        cyhal_gpio_toggle(LED2);
    }

    /*Turn off LED2*/
    cyhal_gpio_write(LED2, CYBSP_LED_STATE_OFF);
    return false;
}

/*Context Activation, returns true and IP address if succeeded, must have 15 bytes allocated*/
static _Bool ContextActivation(char *ip_address)
{
    char *result = NULL;
    char *temp = NULL;
    int check = 0;

    temp = ip_address;

    /*Check if the module is registered.*/
    check = NetworkRegistrationCheck();
    if(!check)
    {
      WaitForNetwork();
    }

    /*Context Activation*/
    result = NULL;
    result = SCP_SendCommandWaitAnswer("AT#SGACT?\r\n", "#SGACT: 1,0", 1000, 1);
    if (!result) result = SCP_SendCommandWaitAnswer("AT#SGACT=1,0\r\n", "OK", 1000, 1);
    if (!result) return false;

    vTaskDelay(pdMS_TO_TICKS(1000));

    result = NULL;
    result = SCP_SendCommandWaitAnswer("AT#SGACT=1,1\r\n", "OK", 60000, 1);
    vTaskDelay(pdMS_TO_TICKS(100));
    if(result)
    {
            result = NULL;
            result = memmem((char*)SCPHandler.RxBuffer, CMD_BUFF_LENGTH, "#SGACT: ", sizeof("#SGACT: ")-1);
            result += 8;

            if(result)
            {
                memset(ip_address, 0x00, 15);

                /*Maximum 15 chars for IP address*/
                for(uint8_t i = 0; i < 15; i++)
                {
                    /*Skip the tags*/
                    if(*result == '"')
                    {
                        result++;
                    }

                    /*Not a number or dot in IP address shall be treated as error*/
                    if(!(*result > 47 && *result < 58) && !(*result == '.') && (!(*result == '\r')))
                    {
                        memset(ip_address, 0x00, 15);
                        return false;
                    }

                    /*The end of the string*/
                    if(*result == '\r')
                    {
                        break;
                    }

                    *temp = *result;
                    result++;
                    temp++;
                }
            }
            return true;
    }
    return false;
}

static _Bool ContextDeactivation(void)
{
  char *result = NULL;
  result = SCP_SendCommandWaitAnswer("AT#SGACT=1,0\r\n", "OK", 1000, 1);
  if(result)
  {
    return true;
  }
  else return false;
}


/*Returns pointer to operator string*/
static char* GetOperator(void)
{
    char *result = NULL;
    static char operator[17];

    /*Request operator*/
    result = SCP_SendCommandWaitAnswer("AT+COPS?\r\n", "OK", 30000, 1);

    /*We have response, lets look for the info in the receiver buffer*/
    if(result)
    {
        result = NULL;
        result = memmem((char*)SCPHandler.RxBuffer, CMD_BUFF_LENGTH, "+COPS:", sizeof("+COPS:")-1);

        /*Response found, lets look for operator string, begins with (") */
        if(result)
        {
            result = strchr(result, '"');

            /*Copy operator to the RAM and return*/
            if(result)
            {
                /*Clean static buffer*/
                memset(operator, 0x00, 17);

                /*Maximum 16 chars for operator initials allowed*/
                for(uint8_t i = 0; i < 16; i++)
                {
                    operator[i] = *result;
                    result++;

                    /*Last operator char?*/
                    if(*result == '"')
                    {
                        i++;
                        operator[i] = *result;
                        return operator;
                    }
                }

                return operator;
            }
        }
    }

    return NULL;
}

/*Returns pointer to IMEI string of 15 numbers*/
static char* GetIMEI(void)
{
    char *result = NULL;
    static char imei[16];
    _Bool isDigit = false;
    uint32_t j = 0, i=0;

    /*Request IMEI*/
    result = SCP_SendCommandWaitAnswer("AT+CGSN\r\n", "OK", 100, 1);

    /*We have response, lets look for the info in the receiver buffer*/
    if(result)
    {
        result = NULL;

        /*Lets look for a ASCII number...*/
        while((j < strlen((char*)SCPHandler.RxBuffer)) && (!isDigit))
        {
          if((SCPHandler.RxBuffer[j] > 47) && (SCPHandler.RxBuffer[j] < 58))
          {
              isDigit = true;
              result = (char*)&SCPHandler.RxBuffer[j];
              break;
          }

          j++;
        }

        /*First number of IMEI found, copy the number to the RAM and return */
        if(result)
        {
            memset(imei, 0x00, 16);

            /*Maximum 15 chars for IMEI is allowed*/
            for(i = 0; i < 15; i++)
            {
                /*Not a number in IMEI shall be treated as error*/
                if(!(*result > 47 && *result < 58))
                {
                    return NULL;
                }

                imei[i] = *result;

                result++;
            }

            return imei;
        }
    }

    return NULL;
}

/*Request model identification*/
static char* GetID(void)
{
    char *result = NULL;
    static char device_id[21];

    /*Request model identification*/
    result = SCP_SendCommandWaitAnswer("AT+CGMM\r\n", "OK", 100, 1);

    /*We have response, lets look for the info in the receiver buffer*/
    if(result)
    {
        result = NULL;
        /*Lets look for a (\n) char as the begining of device name*/
        result = strchr((char*)SCPHandler.RxBuffer, '\n');

        if(result)
        {
            result++;

            /*Copy operator to the RAM and return*/
            memset(device_id, 0x00, 21);

            /*Maximum 20 chars for model identification allowed*/
            for(uint8_t i = 0; i < 20; i++)
            {
                device_id[i] = *result;
                result++;

                /*Device_id end*/
                if(*result == '\r')
                {
                    return device_id;
                }
            }
        }

