RutronikSystemSolutions/RutDevKit-PSoC62_ME310G1-WW/modem.c
    }

    return NULL;
}

/*Returns pointer to firmware version*/
static char* GetVersion(void)
{
    char *result = NULL;
    static char version[16];
    uint32_t i=0;

    /*Request IMEI*/
    result = SCP_SendCommandWaitAnswer("AT+CGMR\r\n", "OK", 100, 1);

    /*We have response, lets look for the info in the receiver buffer*/
    if(result)
    {
        result = NULL;

        /*Lets look for a (\n) char as the begining of firmware version string*/
        result = strchr((char*)SCPHandler.RxBuffer, '\n');

        /*Copy string to RAM */
        if(result)
        {
            result++;
            memset(version, 0x00, 16);

            /*Maximum 15 chars limit*/
            for(i = 0; i < 15; i++)
            {

                version[i] = *result;
                result++;

                if(*result == '\r')
                {
                    break;
                }
            }

            return version;
        }
    }

    return NULL;
}

/*Open socket to address*/
static _Bool ModemOpenTcpSocket(char *pAddress, uint32_t port)
{
    char *result = NULL;
    memset(post_buff, 0, sizeof(post_buff));
    /* Form open socket command */
    sprintf(post_buff, "AT#SD=1,0,%d,\"%s\"\r", (int)port, pAddress);
    result = SCP_SendCommandWaitAnswer(post_buff, "CONNECT", 15000, 1);

    if(result)
    {
        return true;
    }

    return false;
}

/* Close socket */
static _Bool ModemCloseTcpSocket(void)
{
    char *result = NULL;
    /* Form close socket command */
    (void) SCP_SendCommandWaitAnswer("+++\r\n", "OK", 1000, 1);

    result = SCP_SendCommandWaitAnswer("AT#SH=1\r\n", "OK", 1000, 1);

    if(result)
    {
        return true;
    }

    return false;
}

/* Authentication */
static _Bool TelitPortalAuthenticate(void)
{
    char *result = NULL;
    int i = 0;
    char local_buff[1024];

    memset(post_buff, 0, sizeof(post_buff));
    memset(local_buff, 0, sizeof(local_buff));

    /*Reset rx buffer for data reception*/
    SCP_InitRx();

    /* Form data for lenght calculation*/
    sprintf(local_buff, fcmd_dW_auth, telit_appToken, telit_appID, modem_data.imei);

    /* Get data length */
    sprintf(post_length, "%d\r\n\r\n", strlen(local_buff));

    /*Generate full HTTP post*/
    sprintf(post_buff, (char *)fcmd_HTTPPOST);
    strcat(post_buff,post_length);
    strcat(post_buff,local_buff);

    /* Send HTTP POST data */
    SCP_SendData(post_buff, strlen(post_buff));

    /* Wait for full answer */
    result = SCP_WaitForAnswer("}}}", 15000);
    if (result)
    {
        /* Getting session id */
        result = NULL;
        result = strstr((char*)SCPHandler.RxBuffer, "sessionId\":\"");
        if(result)
        {
            result += strlen("sessionId\":\"");
            while ((*result != '\"')&& (i < SESSIONID_LENGTH))
            {
                telit_sessionId[i++]=*(result++);
            }
            if (i <= SESSIONID_LENGTH)
            {
                /* We should wait for the server to shut down the connection */
                result = NULL;
                result = SCP_WaitForAnswer("NO CARRIER", 10000);
                if(result)
                {
                    ModemCloseTcpSocket();
                    printf("SessionID: ");
                    printf(telit_sessionId);
                    printf("\n\r");
                    return true;
                }
            }
        }
    }
    ModemCloseTcpSocket();
    return false;
}

/*Post*/
static _Bool TelitPortalPostData(void)
{
  char *result = NULL;
  uint32_t len;
  char local_buff[1024];
  static float temperature = 0, humidity = 0, pressure = 0;
  static int mag_xy = 0;
  int signal_level,batt_voltage;

  /*Dummy values*/
  temperature++;
  humidity++;
  pressure++;
  mag_xy++;

  batt_voltage = (int)(aADCdata[1]*ADC_VOLTAGE_COEFF);

  memset(post_buff, 0, sizeof(post_buff));
  memset(local_buff, 0, sizeof(local_buff));

  /*Copy variables that might to change during data post*/
  signal_level = modem_data.signal;

  /*Reset rx buffer for data reception*/
  SCP_InitRx();

  /*If we have no GPS data, we have to exclude them from post*/
  if(
     strlen(modem_data.gps_latitude) == 0
       || strlen(modem_data.gps_longitude) == 0
         || strlen(modem_data.gps_altitude) == 0
           || strlen(modem_data.gps_course) == 0
             || strlen(modem_data.gps_speed) == 0
               || strlen(modem_data.gps_precision) == 0
                 )
  {
    /* Calculate post length */
    len =  strlen(fcmd_dw_post_auth) - 2;
    len += strlen(fcmd_dw_post_p1) - 6;
    len += strlen(fcmd_dw_post_p2) - 6;
    len += strlen(fcmd_dw_post_p3) - 6;
    len += strlen(fcmd_dw_post_p4) - 4;
    len += strlen(fcmd_dw_post_p5) - 4;
    len += strlen(fcmd_dw_post_p6) - 4;

    /* Calculate parameters length */
    sprintf(
            (char *)post_buff,"%s%s%s%s%s%s%s%.2f%.2f%.2f%d%d%d",
            telit_sessionId,
            modem_data.imei,
            modem_data.imei,
            modem_data.imei,
            modem_data.imei,
            modem_data.imei,
            modem_data.imei,
            temperature,
            pressure,
            humidity,
            mag_xy,
            batt_voltage,
            signal_level
              );

    len += strlen((char *)post_buff);

    /*Generate full HTTP post*/
    memset(post_buff, 0, sizeof(post_buff));
    sprintf(post_buff, (char *)fcmd_HTTPPOST);
    sprintf((char *)local_buff,"%d\r\n\r\n", (int)len);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_auth, telit_sessionId);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_p1, modem_data.imei, temperature);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_p2, modem_data.imei, pressure);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_p3, modem_data.imei, humidity);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_p4, modem_data.imei, mag_xy);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_p5, modem_data.imei, batt_voltage);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_p6, modem_data.imei, signal_level);
    strcat(post_buff,local_buff);
    strcat(post_buff,"\r\n");

    /* Send HTTP POST data */
    SCP_SendData((char *)post_buff, strlen(post_buff));
    printf("\n\rUPLOADING:\n\r%s\n\r", post_buff);
    vTaskDelay(pdMS_TO_TICKS(1000));

    result = SCP_WaitForAnswer("}}", 15000);
    if (result)
    {
      /* We should wait for the server to shut down the connection */
      result = NULL;
      result = SCP_WaitForAnswer("NO CARRIER", 10000);
      if(result)
      {
        ModemCloseTcpSocket();
        return true;
      }
    }
  }

