RutronikSystemSolutions/RutDevKit-PSoC62_ME310G1-WW/modem.c
  /*Include GNSS data*/
  else
  {
    /* Calculate post length */
    len =  strlen(fcmd_dw_post_auth) - 2;
    len += strlen(fcmd_dw_post_p1) - 6;
    len += strlen(fcmd_dw_post_p2) - 6;
    len += strlen(fcmd_dw_post_p3) - 6;
    len += strlen(fcmd_dw_post_p4) - 4;
    len += strlen(fcmd_dw_post_p5) - 4;
    len += strlen(fcmd_dw_post_p6) - 4;
    len += strlen(fcmd_dw_post_p7) - 14;

    /* Calculate parameters length */
    sprintf(
            (char *)post_buff,"%s%s%s%s%s%s%s%.2f%.2f%.2f%d%d%d%s%s%s%s%s%s%s",
            telit_sessionId,
            modem_data.imei,
            modem_data.imei,
            modem_data.imei,
            modem_data.imei,
            modem_data.imei,
            modem_data.imei,
            temperature,
            pressure,
            humidity,
            mag_xy,
            batt_voltage,
            signal_level,
            modem_data.imei,
            modem_data.gps_latitude,
            modem_data.gps_longitude,
            modem_data.gps_altitude,
            modem_data.gps_course,
            modem_data.gps_speed,
            modem_data.gps_precision
              );

    len += strlen((char *)post_buff);

    /*Generate full HTTP post*/
    memset(post_buff, 0, sizeof(post_buff));
    sprintf(post_buff, (char *)fcmd_HTTPPOST);
    sprintf((char *)local_buff,"%d\r\n\r\n", (int)len);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_auth, telit_sessionId);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_p1, modem_data.imei, temperature);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_p2, modem_data.imei, pressure);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_p3, modem_data.imei, humidity);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_p4, modem_data.imei, mag_xy);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_p5, modem_data.imei, batt_voltage);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff, fcmd_dw_post_p6, modem_data.imei, signal_level);
    strcat(post_buff,local_buff);

    memset(local_buff, 0, sizeof(local_buff));
    sprintf((char *)local_buff,
            fcmd_dw_post_p7,
            modem_data.imei,
            modem_data.gps_latitude,
            modem_data.gps_longitude,
            modem_data.gps_altitude,
            modem_data.gps_course,
            modem_data.gps_speed,
            modem_data.gps_precision);
    strcat(post_buff,local_buff);

    /* Send HTTP POST data */
    SCP_SendData((char *)post_buff, strlen(post_buff));
    printf("\n\rUPLOADING:\n\r%s\n\r", post_buff);
    vTaskDelay(pdMS_TO_TICKS(1000));

    result = SCP_WaitForAnswer("}}", 10000);
    if (result)
    {
      /* We should wait for the server to shut down the connection */
      result = NULL;
      result = SCP_WaitForAnswer("NO CARRIER", 10000);
      if(result)
      {
        ModemCloseTcpSocket();
        return true;
      }
    }
  }

  /*Timeout. In case of error, no }} received*/
  ModemCloseTcpSocket();
  return false;
}

upload_error_t TelitCloudUpload(void)
{
  _Bool authenticated = false; /*have this as 'static' for constant power-on operation*/
  _Bool result = false;
  char * scp_result = NULL;
  upload_error_t return_error = UPLOAD_OK;

  printf("Telit Cloud Upload Procedure Started.\n\r");

  /*Apply power for IoT LTE module*/
  if(!ModemOn(&aADCdata[0]))
  {
    return_error = MODEM_POWER_ON_FAIL;
    goto error_exit;
  }

  /*Start AT Commands*/
  scp_result = SCP_SendCommandWaitAnswer("AT\r\n", "OK", 200, 1);

  /*No response to AT, Retry*/
  if(!scp_result)
  {
	vTaskDelay(pdMS_TO_TICKS(5000));
    cyhal_uart_read_async(&ardu_uart, (void *)&aRxBuffer, 1);
    scp_result = NULL;
    scp_result = SCP_SendCommandWaitAnswer("AT\r\n", "OK", 200, 1);
    if(!scp_result)
    {
      return_error = MODEM_CMD_NO_RESPONSE;
      goto error_exit;
    }
  }

  /*Modem is ON*/
  modem_data.mod_pwr_status = true;

  /*Check PIN*/
  if (scp_result) scp_result = SCP_SendCommandWaitAnswer("AT+CPIN?\r\n", "+CPIN: READY", 2000, 1);
  vTaskDelay(pdMS_TO_TICKS(100));

  /*Echo commands turn off*/
  if (scp_result) scp_result = SCP_SendCommandWaitAnswer("ATE0\r\n", "OK", 2000, 1);

  /*Select Text Mode SMS*/
  if (scp_result) scp_result = SCP_SendCommandWaitAnswer("AT+CMGF=1\r\n", "OK", 2000, 1);

  /*Sets LED Output mode*/
  if (scp_result) scp_result = SCP_SendCommandWaitAnswer("AT#SLED=4\r\n", "OK", 2000, 1);

  if(scp_result)
  {
    /*Get IMEI*/
    scp_result = NULL;
    scp_result = GetIMEI();
    if(scp_result)
    {
      memset(modem_data.imei, 0x00, 16);
      strcpy(modem_data.imei, scp_result);
      printf("IMEI:%s\n\r",modem_data.imei);
    }

    /*Get module type*/
    scp_result = NULL;
    scp_result = GetID();
    if(scp_result)
    {
      memset(modem_data.device_name, 0x00, 21);
      strcpy(modem_data.device_name, scp_result);
      printf("Device:%s\n\r",modem_data.device_name);
    }

    /*Get firmware version*/
    scp_result = NULL;
    scp_result = GetVersion();
    if(scp_result)
    {
      memset(modem_data.fw_version, 0x00, 16);
      strcpy(modem_data.fw_version, scp_result);
      printf("FW Version:%s\n\r",modem_data.fw_version);
    }
  }

  if(!scp_result)
  {
    return_error = MODEM_CMD_NO_RESPONSE;
    goto error_exit;
  }

  /*Set APN*/
  if (scp_result) scp_result = SCP_SendCommandWaitAnswer("AT+CGDCONT?\r\n", "lpwa.telia.iot", 1000, 1);
  if (!scp_result) scp_result = SCP_SendCommandWaitAnswer("AT+CGDCONT=1,\"IP\",\"lpwa.telia.iot\"\r\n", "OK", 2000, 1);

  /*Network Support Setup*/
  if (scp_result) scp_result = SCP_SendCommandWaitAnswer("AT+WS46?\r\n", "+WS46: 30", 1000, 1);
  if (!scp_result) scp_result = SCP_SendCommandWaitAnswer("AT+WS46=30\r\n", "OK", 1000, 1);
  if (scp_result) scp_result = SCP_SendCommandWaitAnswer("AT#WS46?\r\n", "#WS46: 3", 1000, 1);
  if (!scp_result)
  {
    scp_result = SCP_SendCommandWaitAnswer("AT#WS46=3\r\n", "OK", 1000, 1);
    if(!scp_result)
    {
      return_error = MODEM_NET_SELECT_FAIL;
      goto error_exit;
    }
  }

  if (scp_result)
  {
    /*Check if we are connected to GSM network*/
    if(!WaitForNetwork())
    {
      return_error = MODEM_NO_OPERATOR_PRESENT;
      goto error_exit;
    }
  }
  else
  {
    return_error = MODEM_CMD_NO_RESPONSE;
    goto error_exit;
  }

  /*Store signal quality*/
  modem_data.signal = SignalQuality();

