RutronikSystemSolutions/RutDevKit-PSoC62_ME310G1-WW/modem.c
  /*Network status check*/
  modem_data.network_status =  NetworkRegistrationCheck();

  /*registered to home network or registered as roaming is acceptable*/
  if((modem_data.network_status == 1) || (modem_data.network_status == 5))
  {
    /*Store operator*/
    scp_result = NULL;
    scp_result = GetOperator();
    if(scp_result)
    {
      memset(modem_data.provider, 0x00, 17);
      strcpy(modem_data.provider, scp_result);
      printf("Operator: %s\n\r",modem_data.provider);
    }
    else
    {
      return_error = MODEM_NO_OPERATOR_PRESENT;
      goto error_exit;
    }

    /*Check LTE status*/
    modem_data.context = ContextStatusCheck();

    /*Try to connect if not connected*/
    if(!modem_data.context)
    {
      modem_data.context = ContextActivation(modem_data.ip_address);
      if(!modem_data.context)
      {
        ContextDeactivation();
        return_error = MODEM_NO_DATA_SERVICE;
        goto error_exit;
      }
      else
      {
    	  printf("IP Address:%s\n\r",modem_data.ip_address);
      }
    }
  }
  else
  {
    modem_data.context = 0;
    authenticated = false;
    return_error = CLOUD_AUTH_ERROR;
    goto error_exit;
  }

  /*Start uploading*/
  cyhal_gpio_write(LED1, CYBSP_LED_STATE_ON);

  /*Authenticate only once per session*/
  if(!authenticated)
  {
    /*Authenticate */
  Authentication:
    result = ModemOpenTcpSocket("api-de.devicewise.com", 80);
    if(result)
    {
      authenticated = TelitPortalAuthenticate();
    }
    /*Post*/
    if(authenticated)
    {
      result = ModemOpenTcpSocket("api-de.devicewise.com", 80);
      if (result)
      {
        authenticated = TelitPortalPostData();
      }
    }
    if(!result)
    {
      cyhal_gpio_write(LED1, CYBSP_LED_STATE_OFF);
      ContextDeactivation();
      goto error_exit;
    }
  }
  else
  {
    /*Post*/
    result = ModemOpenTcpSocket("api-de.devicewise.com", 80);
    if (result)
    {
      authenticated = TelitPortalPostData();
    }
    /*If post fails try to authenticate*/
    else
    {
      authenticated = false;
      goto Authentication;
    }
  }

  /*Turn off LED1*/
  cyhal_gpio_write(LED1, CYBSP_LED_STATE_OFF);
  /*Turn off Modem*/
  if(!ModemOff(&aADCdata[0]))
  {
    return_error = MODEM_POWER_OFF_FAIL;
    modem_data.mod_pwr_status = false;
    return return_error;
  }
  modem_data.mod_pwr_status = false;
  return return_error;

error_exit:
  /*Turn off LED1*/
  cyhal_gpio_write(LED1, CYBSP_LED_STATE_OFF);
  /*Turn off Modem*/
  if(!ModemOff(&aADCdata[0]))
  {
    return_error = MODEM_POWER_OFF_FAIL;
    modem_data.mod_pwr_status = false;
    return return_error;
  }
  modem_data.mod_pwr_status = false;
  return return_error;
}

static gnss_error_t GNSSFixLocation(uint32_t timeout, char*lat, char*lon, char*spd, char*cur, char*alt, char*acc)
{
	gnss_error_t return_error = GNSS_FIX_OK;
	char * result = NULL;
    char *dir = NULL;
    double coordinate = 0;
	uint8_t i;

	  /*Apply power for IoT LTE module*/
	  if(!ModemOn(&aADCdata[0]))
	  {
	    return_error = GNSS_POWER_ON_FAIL;
	    goto error_exit;
	  }

	  /*Start AT Commands*/
	  result = SCP_SendCommandWaitAnswer("AT\r\n", "OK", 200, 1);

	  /*No response to AT, Retry*/
	  if(!result)
	  {
		vTaskDelay(pdMS_TO_TICKS(5000));
	    cyhal_uart_read_async(&ardu_uart, (void *)&aRxBuffer, 1);
	    result = NULL;
	    result = SCP_SendCommandWaitAnswer("AT\r\n", "OK", 200, 1);
	    if(!result)
	    {
	      return_error = GNSS_CMD_NO_RESPONSE;
	      goto error_exit;
	    }
	  }

	  /*Set WWAN priority to GNSS priority*/
	  if (result) result = SCP_SendCommandWaitAnswer("AT$GPSCFG?\r\n", "GPSCFG: 0,1,1,0", 1000, 1);
	  if (!result)
		  {
		  	SCP_SendCommandWaitAnswer("AT$GPSCFG=0,0\r\n", "OK", 1000, 1);
		  	SCP_SendCommandWaitAnswer("AT#REBOOT\r\n", "OK", 1000, 1);
		  	vTaskDelay(pdMS_TO_TICKS(5000));
		  	cyhal_uart_read_async(&ardu_uart, (void *)&aRxBuffer, 1);
		    result = NULL;
		    result = SCP_SendCommandWaitAnswer("AT\r\n", "OK", 200, 1);
		    if(!result)
		    {
		      return_error = GNSS_CMD_NO_RESPONSE;
		      goto error_exit;
		    }
		  }

	  /*Turn the GNSS on*/
	  vTaskDelay(pdMS_TO_TICKS(100));
	  SCP_SendCommandWaitAnswer("AT$GPSNMUNEX=0,0,0,0,0,0,0,0,0,0,0,1,0\r\n", "OK", 1000, 1);
	  SCP_SendCommandWaitAnswer("AT$GPSNMUN=1,0,0,0,0,0,0\r\n", "OK", 1000, 1);
	  SCP_SendCommandWaitAnswer("AT$GPSP=1\r\n", "OK", 1000, 1);

	  printf("GNSS Receiver Started.\n\r");


	  /*Wait for location fix*/
	  while(timeout > 0)
	  {
		  result = NULL;
		  result = memmem((char*)SCPHandler.RxBuffer, CMD_BUFF_LENGTH, "$GNRMC", sizeof("$GNRMC")-1);
		  if(result)
		  {
			  /*Search for data valid indicator*/
		      for(i = 0; i < 2; i++)
		        {
		    	  result = strchr(result, ',');
		          if(!result)
		          {
		        	  /*Something is wrong with a data buffer?*/
		        	  break;
		          }

		          result++;
		        }

		      /*Check if data is valid*/
		      if(*result == 'A')
		      {
		    	  /*Just wait for a whole message to arrive*/
		    	  vTaskDelay(pdMS_TO_TICKS(50));

		    	  result +=2;
		    	  if(result)
		    	  {
		    		  /*Get the directory and calculate the latitude*/
		              dir = strchr(result, 'N');
		              if(!dir)
		              {
		                  dir = strchr(result, 'S');
		                  if(!dir)
		                  {
		                	  return_error = GNSS_NMEA_READ_ERROR;
		                	  goto error_exit;
		                  }
		              }
		              coordinate = nmea2dec(result, 1, dir);
		              sprintf(lat, "%.6f", coordinate);

		              result = dir;
		              result +=2;
		              if(result)
		              {
		            	  /*Get the directory and calculate the longitude*/
		            	  dir = strchr(result, 'E');
		                  if(!dir)
		                  {
		                      dir = strchr(result, 'W');
		                      if(!dir)
		                      {
			                	  return_error = GNSS_NMEA_READ_ERROR;
			                	  goto error_exit;
		                      }
		                  }
		                  coordinate = nmea2dec(result, 2, dir);
		                  sprintf(lon, "%.6f", coordinate);

			              result = dir;
			              result +=2;
			              if(result)
			              {
			            	  /*Get the speed and convert to km/h*/
			            	  coordinate = atof(result);
			            	  coordinate = coordinate * 1.8520;
			            	  sprintf(spd, "%.1f", coordinate);

			            	  result = strchr(result, ',');
			            	  result++;
			            	  if(result)
			            	  {
			            		  /*Copy the course*/
			            		  strxcpy(cur, result);
			            		  break;
			            	  }
			              }
		              }
		    	  }
		      }
		  }

		  /*Wait a second*/
		  timeout--;
		  vTaskDelay(pdMS_TO_TICKS(1000));
	  }

	if(timeout == 0) {goto error_exit;}

	printf("GNSS LOCATION FIXED\n\r");
    /*Some of the data is not used by this demo*/
    strcpy(alt, "0.0");
    strcpy(acc,"0.0");
    if(strlen(cur) == 0)
    {
  	  strcpy(cur,"0.0");
    }
	SCP_SendCommandWaitAnswer("AT$GPSNMUN=0\r\n", "OK", 1000, 1);
	SCP_SendCommandWaitAnswer("AT$GPSP=0\r\n", "OK", 1000, 1);
	printf("GNSS Receiver Stopped.\n\r");
	return return_error;

	error_exit:
	printf("GNSS NO DATA\n\r");
	SCP_SendCommandWaitAnswer("AT$GPSNMUN=0\r\n", "OK", 1000, 1);
	SCP_SendCommandWaitAnswer("AT$GPSP=0\r\n", "OK", 1000, 1);
	printf("GNSS Receiver Stopped.\n\r");
	return return_error;
}

#ifdef SEND_SMS
static upload_error_t SendSMS(void)
{
	char * scp_result = NULL;
	upload_error_t return_error = UPLOAD_OK;
    char local_buff[50];
    uint8_t i;

    printf("SMS Notification Procedure Started.\n\r");

    /*Apply power for IoT LTE module*/
    if(!ModemOn(&aADCdata[0]))
    {
      return_error = MODEM_POWER_ON_FAIL;
      goto error_exit;
    }

    /*Start AT Commands*/
    scp_result = SCP_SendCommandWaitAnswer("AT\r\n", "OK", 200, 1);

    /*No response to AT, Retry*/
    if(!scp_result)
    {
    	cyhal_uart_read_async(&ardu_uart, (void *)&aRxBuffer, 1);
      for(i=0; i<50; i++)
      {
    	  vTaskDelay(pdMS_TO_TICKS(100));
          scp_result = NULL;
          scp_result = SCP_SendCommandWaitAnswer("AT\r\n", "OK", 100, 1);
          if(scp_result) break;
      }
      if(!scp_result)
      {
        return_error = MODEM_CMD_NO_RESPONSE;
        goto error_exit;
      }
    }

    /*Modem is ON*/
    modem_data.mod_pwr_status = true;

