RutronikSystemSolutions/RutDevKit-PSoC62_ME310G1-WW/modem.c
    /*Check PIN*/
    scp_result = SCP_SendCommandWaitAnswer("AT+CPIN?\r", "+CPIN: READY", 2000, 1);
    vTaskDelay(pdMS_TO_TICKS(100));

    /*Echo commands turn off*/
    if (scp_result) scp_result = SCP_SendCommandWaitAnswer("ATE0\r", "OK", 2000, 1);

    /*Select Text Mode SMS*/
    if (scp_result) scp_result = SCP_SendCommandWaitAnswer("AT+CMGF=1\r", "OK", 2000, 1);

    /*Sets LED Output mode*/
    if (scp_result) scp_result = SCP_SendCommandWaitAnswer("AT#SLED=4\r", "OK", 2000, 1);

    if(!scp_result)
    {
      return_error = MODEM_CMD_NO_RESPONSE;
      goto error_exit;
    }

    /*Network Support Setup*/
    if (scp_result) scp_result = SCP_SendCommandWaitAnswer("AT+WS46?\r\n", "+WS46: 30", 1000, 1);
    if (!scp_result) scp_result = SCP_SendCommandWaitAnswer("AT+WS46=30\r\n", "OK", 1000, 1);
    if (scp_result) scp_result = SCP_SendCommandWaitAnswer("AT#WS46?\r\n", "#WS46: 3", 1000, 1);
    if (!scp_result)
    {
      scp_result = SCP_SendCommandWaitAnswer("AT#WS46=3\r\n", "OK", 1000, 1);
      if(!scp_result)
      {
        return_error = MODEM_NET_SELECT_FAIL;
        goto error_exit;
      }
    }

    if (scp_result)
    {
      /*Check if we are connected to GSM network*/
      if(!WaitForNetwork())
      {
        return_error = MODEM_NO_OPERATOR_PRESENT;
        goto error_exit;
      }
    }
    else
    {
      return_error = MODEM_CMD_NO_RESPONSE;
      goto error_exit;
    }

    /*Store signal quality*/
    modem_data.signal = SignalQuality();

    /*Network status check*/
    modem_data.network_status =  NetworkRegistrationCheck();

    /*Registered to home network or registered as roaming is acceptable*/
    if((modem_data.network_status == 1) || (modem_data.network_status == 5))
    {
      /*Store operator*/
      scp_result = NULL;
      scp_result = GetOperator();
      if(scp_result)
      {
        memset(modem_data.provider, 0x00, 17);
        strcpy(modem_data.provider, scp_result);
        printf("Operator: %s\n\r",modem_data.provider);
      }
      else
      {
        return_error = MODEM_NO_OPERATOR_PRESENT;
        goto error_exit;
      }
    }

    /*Make first SMS*/
    memset(sms_buff, 0x00, sizeof(sms_buff));
    sprintf(sms_buff, "Device Activated!");
    memset(local_buff, 0x00, sizeof(local_buff));
    sprintf(local_buff, " Signal %d", (int)(modem_data.signal*100/31));
    strcat(local_buff, "%");
    strcat(sms_buff, local_buff);

    /*Termination symbol*/
    strcat(sms_buff, "\032");

    /*Send the SMS*/
    memset(local_buff, 0x00, sizeof(local_buff));
    sprintf(local_buff, "AT+CMGS=%s\r", phone_number);
    SCP_SendDoubleCommandWaitAnswer(local_buff, sms_buff, ">", "OK", 5000, 1);

    /*Wait for the message to be delivered*/
    vTaskDelay(pdMS_TO_TICKS(5000));

    /*Clear all old data*/
    memset(modem_data.gps_latitude,0x00,sizeof(modem_data.gps_latitude));
    memset(modem_data.gps_longitude,0x00,sizeof(modem_data.gps_longitude));
    memset(modem_data.gps_altitude,0x00,sizeof(modem_data.gps_altitude));
    memset(modem_data.gps_precision,0x00,sizeof(modem_data.gps_precision));
    memset(modem_data.gps_course,0x00,sizeof(modem_data.gps_course));
    memset(modem_data.gps_speed,0x00,sizeof(modem_data.gps_speed));

    /*Try to catch the GNSS signal*/
    GNSSFixLocation(60,modem_data.gps_latitude,modem_data.gps_longitude,modem_data.gps_speed,modem_data.gps_course, modem_data.gps_altitude, modem_data.gps_precision);

    /*Make second SMS*/
    if(strlen(modem_data.gps_latitude) != 0)
    {
        memset(sms_buff, 0x00, sizeof(sms_buff));
        memset(local_buff, 0x00, sizeof(local_buff));
        sprintf(sms_buff, google_link, modem_data.gps_latitude, modem_data.gps_longitude);
        /*Termination symbol*/
        strcat(sms_buff, "\032");
        /*Send the SMS*/
        sprintf(local_buff, "AT+CMGS=%s\r", phone_number);
        SCP_SendDoubleCommandWaitAnswer(local_buff, sms_buff, ">", "OK", 5000, 1);
    }

    /*Wait for the message to be delivered*/
    vTaskDelay(pdMS_TO_TICKS(5000));

    printf("SMS Notification Procedure Ended.\n\r");
    error_exit:
	return return_error;
}
#endif

void ModemTask(void *param)
{
	(void) param;
	static uint32_t cloud_time_counter = TELIT_CLOUD_UPDATE_INTERVAL;
	upload_error_t return_error;

	printf("Modem Task Started.\n\r");

#ifdef SYSTEM_SHUT_DOWN
  /*Upload*/
  HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET);

  GNSSFixLocation(
		  60,
		  modem_data.gps_latitude,
		  modem_data.gps_longitude,
		  modem_data.gps_speed,
		  modem_data.gps_course
		  );

  /*Some data is not used in the demo*/
  strcpy(modem_data.gps_altitude, "0.0");
  strcpy(modem_data.gps_precision,"0.0");
  if(strlen(modem_data.gps_course) == 0)
  {
	  strcpy(modem_data.gps_course,"0.0");
  }


  return_error = TelitCloudUpload();
  while(return_error != UPLOAD_OK)
  {
    return_error = TelitCloudUpload();
  }

  /*Shut Down, system will Reset at wake-up*/
  ShutDown(&hrtc, 60);
#endif

#ifdef SEND_SMS
  SendSMS();
#endif

  for(;;)
  {
    /* Wait 100ms */
	vTaskDelay(pdMS_TO_TICKS(100));

    /*Upload to Telit Cloud*/
    cloud_time_counter++;
    cyhal_gpio_toggle(LED1);
    if(cloud_time_counter >= TELIT_CLOUD_UPDATE_INTERVAL)
    {
      /*Reset counter now*/
      cloud_time_counter = 0;
      cyhal_gpio_write(LED1, CYBSP_LED_STATE_ON);

      /*Clear all old data*/
      memset(modem_data.gps_latitude,0x00,sizeof(modem_data.gps_latitude));
      memset(modem_data.gps_longitude,0x00,sizeof(modem_data.gps_longitude));
      memset(modem_data.gps_altitude,0x00,sizeof(modem_data.gps_altitude));
      memset(modem_data.gps_precision,0x00,sizeof(modem_data.gps_precision));
      memset(modem_data.gps_course,0x00,sizeof(modem_data.gps_course));
      memset(modem_data.gps_speed,0x00,sizeof(modem_data.gps_speed));

      /*Try to catch the GNSS signal, */
      GNSSFixLocation(60,modem_data.gps_latitude,modem_data.gps_longitude,modem_data.gps_speed,modem_data.gps_course, modem_data.gps_altitude, modem_data.gps_precision);

      printf("Latitude %s\n\r", modem_data.gps_latitude);
      printf("Longitude %s\n\r", modem_data.gps_longitude);
      printf("Speed %s\n\r", modem_data.gps_speed);
      printf("Course %s\n\r", modem_data.gps_course);

      /*Upload to cloud*/
      return_error = TelitCloudUpload();
      if(return_error == UPLOAD_OK)
      {
      	printf("UPLOAD OK\n\r\n\r");
      }
      else
      {
      	printf("UPLOAD ERROR\n\r\n\r");
      }
    }
  }
}

/*This task looks for Unsolicited Result Code and initializes String Command Parser*/
void URCReceiverTask(void *param)
{
    /*AT parser initialization*/
	SCP_Init(uart_send_buff, uart_read_byte);

	/*Reset AT Parser rx buffer */
	SCP_InitRx();

	/*AT Callback Register*/
    SCP_AddCallback("RING", IncomingCall);

    /*Start Modem Task*/
    xTaskCreate(ModemTask, "modem task", configMINIMAL_STACK_SIZE*32, NULL, configMAX_PRIORITIES - 3, &ModemTaskHandle);
    if(ModemTaskHandle == NULL)
    {
    	printf("Error: could not create main_task.\r\n");
    	handle_error();
    }

	for(;;)
	{
	    /* Wait 100ms */
		vTaskDelay(pdMS_TO_TICKS(100));

	    /*Look for URC received(Unsolicited Result Code)*/
	    SCP_Process();

	}
}



